---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SteelElemWeldDoubleWeldprep
source: html/475298f0-6aad-cf91-d4f1-415b9a293f7a.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SteelElemWeldDoubleWeldprep Property

"Double Weld preparation"

## Syntax (C#)
```csharp
public static ForgeTypeId SteelElemWeldDoubleWeldprep { get; }
```